//-----------------------------------------------------------------------------
// 【NormalBehavior.cpp】
// 【普通任务行为策略类实现】
// 【开发者及日期】 QJQ 2026.7.29
//-----------------------------------------------------------------------------

#include "NormalBehavior.hpp"

//-----------------------------------------------------------------------------
// 【NormalBehavior::CanAllocate】
// 【函数功能】判断当前是否可以分配资源，普通任务始终允许分配
// 【参数】无
// 【返回值】true，表示始终允许分配
// 【开发者及日期】 QJQ 2026.7.29
//-----------------------------------------------------------------------------
bool NormalBehavior::CanAllocate() const
{
    return true;
}
