//-----------------------------------------------------------------------------
// 【NormalPolicy.cpp】
// 【普通资源分配策略类实现】
// 【开发者及日期】 QJQ 2026.7.29
//-----------------------------------------------------------------------------

#include "NormalPolicy.hpp"

//-----------------------------------------------------------------------------
// 【NormalPolicy::canAllocate】
// 【函数功能】判断当前是否可以分配资源，普通策略始终允许分配
// 【参数】无
// 【返回值】true，表示始终允许分配
// 【开发者及日期】 QJQ 2026.7.29
//-----------------------------------------------------------------------------
bool NormalPolicy::canAllocate() const
{
    return true;
}
